[/Script/GameProjectGeneration.TemplateProjectDefs]

Categories=Games


LocalizedDisplayNames=(Language="en",Text="Third Person")
LocalizedDescriptions=(Language="en",Text="This template features a playable character where the camera observes an over-the-shoulder point of view. The player can rotate the camera and move around using keyboard, mouse, controller or virtual joystick on a touch device. You can select a genre-specific starting point from the Variants drop-down. The C++ version includes code and content for all variants.")

LocalizedDisplayNames=(Language="ko",Text="3인칭")
LocalizedDescriptions=(Language="ko",Text="이 템플릿은 카메라가 어깨 너머 시점으로 관찰하는 플레이 가능한 캐릭터를 제공합니다. 플레이어는 키보드, 마우스, 컨트롤러 또는 터치 디바이스의 가상 조이스틱을 사용하여 카메라를 회전하고 이동할 수 있습니다. 배리언트 드롭다운에서 장르에 맞게 시작할 옵션을 선택할 수 있습니다. C++ 버전에는 모든 배리언트에 대한 코드와 콘텐츠가 포함되어 있습니다.")

LocalizedDisplayNames=(Language="ja",Text="三人称")
LocalizedDescriptions=(Language="ja",Text="このテンプレートには、カメラが肩越しの視点で表示されるプレイアブル キャラクターが含まれています。プレイヤーは、キーボード、マウス、コントローラー、またはタッチ デバイスのバーチャル ジョイスティックを使用して、カメラを回転させたり移動したりできます。[バリアント] ドロップダウンからジャンル固有の開始点を選択できます。C++ バージョンには、すべてのバリアントのコードとコンテンツが含まれています")

LocalizedDisplayNames=(Language="zh-Hans",Text="第三人称模板")
LocalizedDescriptions=(Language="zh-Hans",Text="此模板包含一个可操控的角色，镜头采用过肩视角进行拍摄。玩家可以通过键盘、鼠标、手柄或触控设备上的虚拟摇杆来旋转镜头并进行移动。你可以从“变体（Variants）”下拉菜单中选择特定游戏类型的起始点。C++版本包含了所有变体的代码和内容。")

; This project uses a thumbnail as the project icon
bThumbnailAsIcon=true

ClassTypes=Character, SpringArmComponent, PlayerController, GameMode
AssetTypes=Animation Sequence, Animation Blueprint, Skeleton, Skeletal Mesh, Control Rig

FoldersToIgnore=Binaries
FoldersToIgnore=Build
FoldersToIgnore=Intermediate
FoldersToIgnore=Saved
FoldersToIgnore=Media

FilesToIgnore="%TEMPLATENAME%.uproject"
FilesToIgnore="%TEMPLATENAME%.png"
FilesToIgnore="Config/TemplateDefs.ini"
FilesToIgnore="Config/config.ini"
FilesToIgnore="%TEMPLATENAME%.opensdf"
FilesToIgnore="%TEMPLATENAME%.sdf"
FilesToIgnore="%TEMPLATENAME%.v11.suo"
FilesToIgnore="%TEMPLATENAME%.v12.suo"
FilesToIgnore="%TEMPLATENAME%.sln"
FilesToIgnore="Manifest.json"
FilesToIgnore="contents.txt"
FoldersToIgnore=Content/ThirdPerson/Animations
FoldersToIgnore=Content/ThirdPerson/Character

FolderRenames=(From="Source/%TEMPLATENAME%",To="Source/%PROJECTNAME%")
FolderRenames=(From="Source/%TEMPLATENAME%Editor",To="Source/%PROJECTNAME%Editor")

FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
FilenameReplacements=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)

ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_UPPERCASE%",To="%PROJECTNAME_UPPERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME_LOWERCASE%",To="%PROJECTNAME_LOWERCASE%",bCaseSensitive=true)
ReplacementsInFiles=(Extensions=("cpp","h","ini","cs"),From="%TEMPLATENAME%",To="%PROJECTNAME%",bCaseSensitive=false)
SharedContentPacks=(MountName="LevelPrototyping",DetailLevels=("High"))
SharedContentPacks=(MountName="Characters",DetailLevels=("High"))
SharedContentPacks=(MountName="Input",DetailLevels=("High"))
EditDetailLevelPreference="High"